app/controllers/portfoliostocks_controller.rb

    def index
        portfoliostocks = Portfoliostock.all
---
SELECT "portfoliostocks".* FROM "portfoliostocks"
SELECT "stocks".* FROM "stocks" WHERE "stocks"."portfoliostock_id" = $1  [["portfoliostock_id", 1]]