app/controllers/portfolios_controller.rb

    def index
        portfolios = Portfolio.all
---
SELECT "portfolios".* FROM "portfolios"

    def create
        portfolio = Portfolio.create(portfolioParams)
---
INSERT INTO "portfolios" ("name", "user_id") VALUES ($1, $2) RETURNING "id"  [["name", "New Portfolio"], ["user_id", 2]]

    def show
        portfolio = Portfolio.find(params[:id])
---
SELECT "portfolios".* FROM "portfolios" WHERE "portfolios"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]