app/controllers/stocks_controller.rb

    def index
        stocks = Stock.all
---
SELECT "stocks".* FROM "stocks"